УТ_для_edt.РасширениеСмарт/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Партнеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НеизвестныйПартнер</name>
      <description>Неизвестный партнер</description>
    </items>
  </predefined>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтакнаяИнформацияПартнераАнгл</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартОсновнойМенеджерСервисЦентра</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартДилерСервисЦентра</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перепродавец</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерСпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерАдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерАдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерКонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерТелефонКонтактногоЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерПропускнаяСистема</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерДополнительнаяОбработкаГрузаТранспортнойКомпанией</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерСпособДоставкиТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерПлатильщикЗаДоставкуГруза</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="431ea12d-0bcd-44da-8c13-8fd3e3e1a591">
    <name>смартДилерБывший</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8d8288f2-9450-4c32-b3b2-af0cc494cf90">
    <name>смартКлючевойКлиентПоРасходнымМатериалам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартОборудованиеКлиентов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>смартНаименованиеОборудования</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартОборудованиеКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>смартКомментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартДатаДобавления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартЧернилаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>смартЧернилаКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>смартКомментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартДатаДобавления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="a039b99d-5c3e-46bf-b321-17891d574d3e">
    <name>смартВидыДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="b5fe9406-a0b5-49eb-9e30-99dd19a7a18b">
      <name>ВидДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c9650fb8-3e0f-4ca1-b198-3b3d9b8f018c">
    <name>смартТипичноеОборудование</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="082a786c-a92a-457f-bce6-eb2074d564f5">
      <name>ТипичноеОборудование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Enums/ЮрФизЛицо/ЮрФизЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЮрФизЛицо</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ЮрЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЮрЛицоНеРезидент</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныйПредприниматель</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыКонтактнойИнформации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Skype</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Факс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Другое</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Партнеры/Forms/ФормаСписка/Module.bsl
//++ смарт:ММ #036 176 17.03.2020 - создание партнеров от дилеров
&НаКлиенте
Перем ПараметрыОбработчика;
//-- смарт:ММ 17.03.2020

#Область ПеренесеноСДоработками
// Богус++
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Заметки.Параметры.УстановитьЗначениеПараметра("Предмет", Справочники.Партнеры.ПустаяСсылка());
	Элементы.СтраницыТипФильтра.Видимость=ИспользоватьФильтр;
	Элементы.ГруппаТолькоМоиСегменты.Видимость=ИспользоватьФильтр;
	
	//++ смарт:ММ #021 195 15.02.2020 - доработка справочника Проекты
	ДобавитьИзменитьЭлементыФормы();
	//-- смарт:ММ 15.02.2020
	
КонецПроцедуры

&НаКлиенте
Процедура смарт_ТолькоМоиПриИзмененииВместо(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭтаФорма.Список.Отбор,
		"ОсновнойМенеджер",
		ЭтаФорма.ТекущийПользователь,
		ВидСравненияКомпоновкиДанных.Равно,,
		ЭтаФорма.ТолькоМои);
КонецПроцедуры

&НаКлиенте
&После("ОбработатьАктивизациюСтрокиСписка")
Процедура смарт_ОбработатьАктивизациюСтрокиСписка()
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		СсылкаПартнер = ?(ЗначениеЗаполнено(ТекущиеДанные.Ссылка), ТекущиеДанные.Ссылка, ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка"));
		Заметки.Параметры.УстановитьЗначениеПараметра("Предмет", СсылкаПартнер);	
		Элементы.Заметки.Обновить();	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура смарт_ИспользоватьФильтрПриИзмененииПосле(Элемент)
	Элементы.СтраницыТипФильтра.Видимость=ИспользоватьФильтр;
	Элементы.ГруппаТолькоМоиСегменты.Видимость=ИспользоватьФильтр;
КонецПроцедуры
// Богус--
#КонецОбласти

#Область ДоработкиСмарт

&НаКлиенте
Процедура ЗаметкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ПоказатьЗначение(,Элемент.ТекущиеДанные.Ссылка);
КонецПроцедуры

// Фролов+
&НаКлиенте
Процедура смарт_СоздатьЗаметкуВместо(Команда)
	ОткрытьФорму("Справочник.Заметки.ФормаОбъекта",Новый Структура("Предмет",Элементы.Список.ТекущиеДанные.Ссылка),ЭтаФорма,,,,Новый ОписаниеОповещения("ПослеСозданияНовойЗаметки",ЭтаФорма));
КонецПроцедуры

&НаКлиенте
Процедура ПослеСозданияНовойЗаметки(Результат,ДопПараметры)Экспорт
	Элементы.Заметки.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура смарт_смартТолькоМоиЗаметкиПриИзмененииВместо(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭтаФорма.Заметки.Отбор,
		"Автор",
		ЭтаФорма.ТекущийПользователь,
		ВидСравненияКомпоновкиДанных.Равно,,
		смартТолькоМоиЗаметки);
КонецПроцедуры
// Фролов-

#КонецОбласти

//++ смарт:ММ #021 195 15.02.2020 - доработка справочника Проекты
&НаСервере
Процедура ДобавитьИзменитьЭлементыФормы()
	
	// Добавление команды открытия формы списка Проектов
	
	ИмяКоманды = "смартОткрытьПроекты";
	КомандаФормы = ЭтаФорма.Команды.Добавить(ИмяКоманды);
	КомандаФормы.Действие = "смартОткрытьПроектыНажатие";
	КомандаФормы.Заголовок = "Проекты";
	КомандаФормы.ИзменяетСохраняемыеДанные = Ложь;
	
	НовыйЭлемент = ЭтаФорма.Элементы.Вставить("смартОткрытьПроекты", Тип("КнопкаФормы"), Элементы.ГруппаСписок, Элементы.СтраницыКонтекстныеОтчеты);
	НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка;
	НовыйЭлемент.ИмяКоманды = ИмяКоманды;
	
	//++ смарт:ММ #036 176 14.03.2020 - создание партнеров от дилеров
	
	// Команда загрузки данных по партнеру из файла
	
	ИмяКоманды = "смартЗагрузитьПартнераИзФайла";
	КомандаФормы = ЭтаФорма.Команды.Добавить(ИмяКоманды);
	КомандаФормы.Действие 	= "смартЗагрузитьПартнераИзФайлаНажатие";
	КомандаФормы.Заголовок 	= "Загрузить из файла";
	КомандаФормы.Подсказка 	= "Загрузить из Excel от дилера";
	
	НовыйЭлемент = Элементы.Вставить("смартЗагрузитьПартнераИзФайла", Тип("КнопкаФормы"), Элементы.СписокГруппаКомандыФормы, Элементы.ФормаНайти);
	НовыйЭлемент.Вид 			= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды 	= ИмяКоманды;
	НовыйЭлемент.Картинка 		= БиблиотекаКартинок.ЗагрузкаИзВнешнегоИсточника;
	НовыйЭлемент.Отображение 	= ОтображениеКнопки.Картинка;
	
	
	Реквизиты = Новый Массив;
	Реквизиты.Добавить(Новый РеквизитФормы("ФоновоеЗаданиеИдентификатор", Новый ОписаниеТипов()));
	Реквизиты.Добавить(Новый РеквизитФормы("ФоновоеЗаданиеАдресХранилища", Новый ОписаниеТипов("Строка")));
	Реквизиты.Добавить(Новый РеквизитФормы("АдресДанныеДляЗаполнения", Новый ОписаниеТипов("Строка")));
	ИзменитьРеквизиты(Реквизиты);
	
	// Команда отправки файла-шаблона клиенту
	
	ИмяКоманды = "смартОтправитьШаблонДилеру";
	КомандаФормы = ЭтаФорма.Команды.Добавить(ИмяКоманды);
	КомандаФормы.Действие 	= "смартОтправитьШаблонДилеруНажатие";
	КомандаФормы.Заголовок 	= "Отправить шаблон дилеру для передачи партнера";
	КомандаФормы.Подсказка 	= "Отправить шаблон дилеру для передачи партнера";
	
	НовыйЭлемент = Элементы.Вставить("смартОтправитьШаблонДилеру", Тип("КнопкаФормы"), Элементы.ФормаВзаимодействия);//, Элементы.ФормаЖурналДокументовВзаимодействияНаписатьЭлектронноеПисьмоПоКонтакту);
	НовыйЭлемент.Вид 			= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды 	= ИмяКоманды;
	НовыйЭлемент.Картинка 		= БиблиотекаКартинок.ОтправитьЭлектронноеПисьмо;
	НовыйЭлемент.Отображение 	= ОтображениеКнопки.КартинкаИТекст;
	
	//-- смарт:ММ 14.03.2020
	
КонецПроцедуры //-- смарт:ММ 15.02.2020

//++ смарт:ММ #021 195 15.02.2020 - доработка справочника Проекты
&НаКлиенте
Процедура смартОткрытьПроектыНажатие(Команда)

	ОткрытьФорму("Справочник.Проекты.Форма.смарт_ФормаСписка", , ЭтаФорма);

КонецПроцедуры //-- смарт:ММ 15.02.2020

//++ смарт:ММ #036 176 14.03.2020 - создание партнеров от дилеров
&НаКлиенте
Процедура смартЗагрузитьПартнераИзФайлаНажатие(Команда)
	
	ПараметрыОбработчика = Неопределено;
	ФоновоеЗаданиеИдентификатор = Неопределено;
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.Заголовок = "Выбор файла для загрузки";
	ДиалогОткрытияФайла.ПроверятьСуществованиеФайла = Ложь;
	ДиалогОткрытияФайла.Фильтр = "Табличный документ(*.xls; *.xlsx)|*.xls;*.xlsx";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";

	Если ДиалогОткрытияФайла.Выбрать() Тогда
		
		МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
		
		Для Каждого ИмяФайла Из МассивФайлов Цикл
			
			// Переменные, которые понядобятся, если необходимо будет открыть форму помощника
			
			УказыватьЮридическиеРеквизиты = Ложь;
			УказатьДанныеКонтактногоЛица = Истина;
			ИспользуютсяТолькоПартнеры = Ложь;
			ВидКомпании = 0;
			ЭтоКомпания = 0;
			КПП = "";
						
			ДанныеИзФайла = ПрочитатьФайл(ИмяФайла);
			
			ДанныеДляЗаполнения = Новый Структура;
			ДанныеДляЗаполнения.Вставить("ДанныеИзФайла", ДанныеИзФайла);
			БизнесРегион = "";
			Если ЗначениеЗаполнено(ДанныеИзФайла.БизнесРегион) Тогда
				БизнесРегион = НайтиБизнесРегион(ДанныеИзФайла.БизнесРегион);
			КонецЕсли;
			
			ДанныеДляЗаполнения.Вставить("БизнесРегион", БизнесРегион);
			ДанныеДляЗаполнения.Вставить("Клиент", Истина);
			ДанныеДляЗаполнения.Вставить("ПолноеНаименование", ДанныеИзФайла.Наименование);
			ДанныеДляЗаполнения.Вставить("ПолноеЮридическоеНаименование", ДанныеИзФайла.Наименование);
			ДанныеДляЗаполнения.Вставить("АдресЭППартнера", ДанныеИзФайла.ПартнерЭлПочта);
			ДанныеДляЗаполнения.Вставить("ТелефонПартнера", "");
			ДанныеДляЗаполнения.Вставить("ТелефонПартнераЗначенияПолей", "");
			ДанныеДляЗаполнения.Вставить("Название", ДанныеИзФайла.Наименование);
			ДанныеДляЗаполнения.Вставить("ГруппаДоступа", "");
			ДанныеДляЗаполнения.Вставить("ФактическийАдрес", "");
			ДанныеДляЗаполнения.Вставить("ФактическийАдресЗначенияПолей", "");
			ДанныеДляЗаполнения.Вставить("ЮридическийАдрес", "");
			ДанныеДляЗаполнения.Вставить("ЮридическийАдресЗначенияПолей", "");
			ДанныеДляЗаполнения.Вставить("КодПоОКПО", "");
			ДанныеДляЗаполнения.Вставить("РегистрационныйНомер", "");
			ДанныеДляЗаполнения.Вставить("СтранаРегистрации", "");
			ДанныеДляЗаполнения.Вставить("НалоговыйНомер", "");
			ДанныеДляЗаполнения.Вставить("ИННПартнерФизЛицо", "");
			ДанныеДляЗаполнения.Вставить("ВидДокумента", "");
			ДанныеДляЗаполнения.Вставить("СерияДокумента", "");
			ДанныеДляЗаполнения.Вставить("НомерДокумента", "");
			ДанныеДляЗаполнения.Вставить("ИспользуютсяТолькоПартнеры", ИспользуютсяТолькоПартнеры);
			ДанныеДляЗаполнения.Вставить("ТелефонКонтрагента", "");
			ДанныеДляЗаполнения.Вставить("ТелефонКонтрагентаЗначенияПолей", "");
			ДанныеДляЗаполнения.Вставить("ИННИсточникДанныхЗаполнения", "");
			ДанныеДляЗаполнения.Вставить("НаименованиеКонтрагента", ДанныеИзФайла.Наименование);
			ДанныеДляЗаполнения.Вставить("КПП", "");
			ДанныеДляЗаполнения.Вставить("ИНН", ДанныеИзФайла.ИНН);
			ДанныеДляЗаполнения.Вставить("УказатьДанныеКонтактногоЛица", УказатьДанныеКонтактногоЛица);
			ДанныеДляЗаполнения.Вставить("УказыватьЮридическиеРеквизиты", УказыватьЮридическиеРеквизиты);
			ДанныеДляЗаполнения.Вставить("ИмяПартнера", "");
			ДанныеДляЗаполнения.Вставить("ФамилияПартнера", "");
			ДанныеДляЗаполнения.Вставить("ОтчествоПартнера", "");
			ДанныеДляЗаполнения.Вставить("КодОКВЭД", "");
			ДанныеДляЗаполнения.Вставить("ПолПартнера", "");
			ДанныеДляЗаполнения.Вставить("РегистрацияВНалоговомОргане", "");
			ДанныеДляЗаполнения.Вставить("РегистрацияВПенсионномФонде", "");
			ДанныеДляЗаполнения.Вставить("ТелефонКЛ", ДанныеИзФайла.КонтактноеЛицоТелефон);
		
			Если ЗначениеЗаполнено(ДанныеИзФайла.ИНН) Тогда				
				ИНН = ДанныеИзФайла.ИНН;
				Если СтрДлина(ИНН) = 12 Тогда
					ВидКомпании = 2;
					ЭтоКомпания = 0;
				КонецЕсли;
				УказыватьЮридическиеРеквизиты = Истина;
				ДанныеДляЗаполнения.Вставить("УказыватьЮридическиеРеквизиты", УказыватьЮридическиеРеквизиты);
				ДанныеДляЗаполнения.Вставить("ИНН", ИНН);
				ДанныеДляЗаполнения.Вставить("ЭтоКомпания", ЭтоКомпания);
				ДанныеДляЗаполнения.Вставить("ВидКомпании", ВидКомпании);
				
				ЮрФизЛицо = смартПроверкаПартнеров.ТипЮрФизЛицаКонтрагента(ЭтоКомпания, ВидКомпании);
				
				Если ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо") Тогда					
					ЭтоКомпания = 1;
				ИначеЕсли ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель") Тогда					
					ЭтоКомпания = 0;
					ВидКомпании = 2;
				ИначеЕсли ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицоНеРезидент") Тогда					
					ЭтоКомпания = 0;
					ВидКомпании = 1;
				Иначе				
					ЭтоКомпания = 0;
					//ВидКомпании = ?(ОбособленноеПодразделение, 3, 0);
					ВидКомпании = 0;
				КонецЕсли;

		
				ЭтоЮридическоеЛицо = ОбщегоНазначенияУТКлиентСервер.ЭтоЮрЛицо(ЮрФизЛицо);
				
				РеквизитыПоИННСервер(ЭтоЮридическоеЛицо, ИНН);

				РезультатФормирования = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресДанныеДляЗаполнения);
				
				Если ТипЗнч(РезультатФормирования) = Тип("Структура") Тогда
					Если ЗначениеЗаполнено(РезультатФормирования.ОписаниеОшибки) Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатФормирования.ОписаниеОшибки + Символы.ПС + "Попробуйте повторно");
						
					Иначе
						ВыполнитьЗаполнениеРеквизитовПоИНН(РезультатФормирования, ДанныеДляЗаполнения);
					КонецЕсли;
				КонецЕсли;
				
				ПродолжитьЗаполнение(ДанныеДляЗаполнения, РезультатФормирования);
				
			КонецЕсли;
									
		КонецЦикла;
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Файл не выбран!'; en = 'File is not selected!'"));
	КонецЕсли;

КонецПроцедуры //-- смарт:ММ 14.03.2020

//++ смарт:ММ #036 217 24.03.2020
&НаСервереБезКонтекста
Функция НайтиБизнесРегион(БизнесРегион)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	БизнесРегионы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.БизнесРегионы КАК БизнесРегионы
	|ГДЕ
	|	БизнесРегионы.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", СокрЛП(БизнесРегион));
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции //-- смарт:ММ 24.03.2020

//++ смарт:ММ #036 217 23.03.2020 - создание партнеров от дилеров
&НаСервере
Процедура РеквизитыПоИННСервер(ЭтоЮридическоеЛицо, ИНН)
	
	Если ЭтоЮридическоеЛицо Тогда
		мРезультатФормирования = РаботаСКонтрагентами.РеквизитыЮридическогоЛицаПоИНН(ИНН);
	Иначе
		мРезультатФормирования = РаботаСКонтрагентами.РеквизитыПредпринимателяПоИНН(ИНН);
	КонецЕсли;

	ПартнерыИКонтрагентыВызовСервера.ИсторияРеквизитовВСтруктуру(мРезультатФормирования);
	
	ЭтаФорма.АдресДанныеДляЗаполнения = ПоместитьВоВременноеХранилище(мРезультатФормирования);
	
КонецПроцедуры //-- смарт:ММ 23.03.2020

//++ смарт:ММ #036 217 23.03.2020 - создание партнеров от дилеров
&НаКлиенте
Процедура ПродолжитьЗаполнение(ДанныеДляЗаполнения, РезультатФормирования)
	
	ДанныеИзФайла = ДанныеДляЗаполнения.ДанныеИзФайла;
	
	Если ЗначениеЗаполнено(ДанныеИзФайла.КПП) И НЕ ЗначениеЗаполнено(ДанныеДляЗаполнения.КПП) Тогда
		ДанныеДляЗаполнения.Вставить("УказыватьЮридическиеРеквизиты", Истина);
		ДанныеДляЗаполнения.Вставить("КПП", ДанныеИзФайла.КПП);
	КонецЕсли;
	
	
	ВсеПоляЗаполнены = Истина;
	СтруктураНезаполненныеРеквизиты = Новый Структура;
	
	ФИОКЛМассив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ДанныеИзФайла.КонтактноеЛицоФИО);
	ФамилияКЛ 	= "";
	ИмяКЛ 		= ДанныеИзФайла.КонтактноеЛицоФИО;
	ОтчествоКЛ 	= "";
	Если ФИОКЛМассив.Количество() > 2 Тогда
		ФамилияКЛ = ФИОКЛМассив[0];
		ИмяКЛ = ФИОКЛМассив[1];
		ОтчествоКЛ = ФИОКЛМассив[2];
	ИначеЕсли ФИОКЛМассив.Количество() > 1 Тогда
		ФамилияКЛ = ФИОКЛМассив[0];
		ИмяКЛ = ФИОКЛМассив[1];
	КонецЕсли;		
	
	ДанныеДляЗаполнения.Вставить("ФамилияКЛ", ФамилияКЛ);
	ДанныеДляЗаполнения.Вставить("ИмяКЛ", ИмяКЛ);
	ДанныеДляЗаполнения.Вставить("ОтчествоКЛ", ОтчествоКЛ);
	
	ДанныеДляЗаполнения.Вставить("АдресЭПКЛ", ДанныеИзФайла.КонтактноеЛицоЭлПочта);
	ДанныеДляЗаполнения.Вставить("МобильныйТелефонКЛ", "");
	
	ДанныеДляЗаполнения.Вставить("АдресЭППартнераФизЛицо", "");
	ДанныеДляЗаполнения.Вставить("ТелефонПартнераФизЛицо", "");
	
	
	ДанныеДляЗаполнения.Вставить("ТелефонПартнераЗначенияПолей", смартПроверкаПартнеров.ПолучитьЗначенияПолейТелефон(ДанныеДляЗаполнения.ТелефонПартнера));
	ДанныеДляЗаполнения.Вставить("ТелефонКЛЗначенияПолей", смартПроверкаПартнеров.ПолучитьЗначенияПолейТелефон(ДанныеДляЗаполнения.ТелефонКЛ));
	ДанныеДляЗаполнения.Вставить("МобильныйТелефонКЛЗначенияПолей", смартПроверкаПартнеров.ПолучитьЗначенияПолейТелефон(ДанныеДляЗаполнения.МобильныйТелефонКЛ));
	ДанныеДляЗаполнения.Вставить("ТелефонПартнераФизЛицоЗначенияПолей", смартПроверкаПартнеров.ПолучитьЗначенияПолейТелефон(ДанныеДляЗаполнения.ТелефонПартнераФизЛицо));
		
	ОбязательныеПоляКонтактнойИнформации = смартПроверкаПартнеров.ОпределитьОбязательностьКонтактнойИнформации();
	
	смартОбщегоНазначенияКлиент.ПроверкаПервичнойИнформацииПартнер(ДанныеДляЗаполнения, СтруктураНезаполненныеРеквизиты, ВсеПоляЗаполнены, ОбязательныеПоляКонтактнойИнформации);
	
	Если НЕ ВсеПоляЗаполнены Тогда	
		
		смартОбщегоНазначенияКлиент.ОткрытьФормуПомощникаСозданияПартнера(ДанныеДляЗаполнения, ЭтаФорма, "СтраницаПервичнаяИнформация");
		
		Для Каждого Элемент Из СтруктураНезаполненныеРеквизиты Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Элемент.Значение);
		КонецЦикла;
	Иначе
		
		ЕстьСовпадения = Ложь;
		СтруктураАдреса = ВыполнитьПоискПоПервичнойИнформацииСервер(ДанныеДляЗаполнения, ЕстьСовпадения);
		Если ЕстьСовпадения Тогда
			смартОбщегоНазначенияКлиент.ОткрытьФормуПомощникаСозданияПартнера(ДанныеДляЗаполнения, ЭтаФорма, "СтраницаНайдено", СтруктураАдреса);
		Иначе
			СозданныйПартнер = Неопределено;
			СозданныйКонтрагент = Неопределено;
			ЗаписатьПартнераИСвязанныеДанные(ДанныеДляЗаполнения, СозданныйПартнер, СозданныйКонтрагент, РезультатФормирования);
			Если ЗначениеЗаполнено(СозданныйПартнер) Тогда
				ПоказатьЗначение(, СозданныйПартнер);
				Элементы.Список.ТекущаяСтрока = СозданныйПартнер;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 23.03.2020

//++ смарт:ММ #036 176 17.03.2020 - создание партнеров от дилеров
Процедура ВыполнитьЗаполнениеРеквизитовПоИНН(РеквизитыКонтрагента, ДанныеДляЗаполнения)
	
	ИспользуютсяТолькоПартнеры = ДанныеДляЗаполнения.ИспользуютсяТолькоПартнеры;
	ИНН = ДанныеДляЗаполнения.ИНН;
	
	ДанныеДляЗаполнения.Вставить("ПолноеНаименование", РеквизитыКонтрагента.Наименование);
	Если РеквизитыКонтрагента.Свойство("КПП") Тогда
		КПП = РеквизитыКонтрагента.КПП;
		ДанныеДляЗаполнения.Вставить("КПП", КПП);
	КонецЕсли;
	ПолноеЮридическоеНаименование = РеквизитыКонтрагента.НаименованиеСокращенное;
	ДанныеДляЗаполнения.Вставить("ПолноеЮридическоеНаименование", ПолноеЮридическоеНаименование);
	ДанныеДляЗаполнения.Вставить("НаименованиеКонтрагента", ПолноеЮридическоеНаименование);
	
	Если РеквизитыКонтрагента.Свойство("Телефон") И РеквизитыКонтрагента.Телефон <> Неопределено Тогда
		ТелефонПартнера              = РеквизитыКонтрагента.Телефон.Представление;
		ТелефонПартнераЗначенияПолей = РеквизитыКонтрагента.Телефон.КонтактнаяИнформация;
		ДанныеДляЗаполнения.Вставить("ТелефонПартнера", ТелефонПартнера);
		ДанныеДляЗаполнения.Вставить("ТелефонПартнераЗначенияПолей", ТелефонПартнераЗначенияПолей);
		Если Не ИспользуютсяТолькоПартнеры Тогда
			ТелефонКонтрагента              = ТелефонПартнера;
			ТелефонКонтрагентаЗначенияПолей = ТелефонПартнераЗначенияПолей;
			ИННИсточникДанныхЗаполнения     = ИНН;
			ДанныеДляЗаполнения.Вставить("ТелефонКонтрагента", ТелефонКонтрагента);
			ДанныеДляЗаполнения.Вставить("ТелефонКонтрагентаЗначенияПолей", ТелефонКонтрагентаЗначенияПолей);
			ДанныеДляЗаполнения.Вставить("ИННИсточникДанныхЗаполнения", ИННИсточникДанныхЗаполнения);
		КонецЕсли;
	КонецЕсли;
	
	Если РеквизитыКонтрагента.Свойство("ЮридическийАдрес") И РеквизитыКонтрагента.ЮридическийАдрес <> Неопределено Тогда
		ЮридическийАдрес              = РеквизитыКонтрагента.ЮридическийАдрес.Представление;
		ЮридическийАдресЗначенияПолей = РеквизитыКонтрагента.ЮридическийАдрес.КонтактнаяИнформация;
		//ПартнерыИКонтрагентыКлиент.ЗаполнитьИсториюАдресовВФорме(ЭтотОбъект, РеквизитыКонтрагента);
		ДанныеДляЗаполнения.Вставить("ЮридическийАдрес", ЮридическийАдрес);
		ДанныеДляЗаполнения.Вставить("ЮридическийАдресЗначенияПолей", ЮридическийАдресЗначенияПолей);
		
	КонецЕсли;
	
	Если РеквизитыКонтрагента.Свойство("Фамилия") И РеквизитыКонтрагента.Фамилия <> Неопределено Тогда		
		ДанныеДляЗаполнения.Вставить("ФамилияПартнера", РеквизитыКонтрагента.Фамилия);
	КонецЕсли;
	
	Если РеквизитыКонтрагента.Свойство("Имя") И РеквизитыКонтрагента.Имя <> Неопределено Тогда		
		ДанныеДляЗаполнения.Вставить("ИмяПартнера", РеквизитыКонтрагента.Имя);
	КонецЕсли;
	
	Если РеквизитыКонтрагента.Свойство("Отчество") И РеквизитыКонтрагента.Отчество <> Неопределено Тогда		
		ДанныеДляЗаполнения.Вставить("ОтчествоПартнера", РеквизитыКонтрагента.Отчество);
	КонецЕсли;
	
	Если РеквизитыКонтрагента.Свойство("КодОКВЭД") И РеквизитыКонтрагента.КодОКВЭД <> Неопределено Тогда		
		ДанныеДляЗаполнения.Вставить("КодОКВЭД", РеквизитыКонтрагента.КодОКВЭД);
	КонецЕсли;
	
	Если РеквизитыКонтрагента.Свойство("Пол") И РеквизитыКонтрагента.Пол <> Неопределено Тогда		
		ДанныеДляЗаполнения.Вставить("ПолПартнера", РеквизитыКонтрагента.Пол);
	КонецЕсли;
	
	Если РеквизитыКонтрагента.Свойство("РегистрационныйНомер") И РеквизитыКонтрагента.РегистрационныйНомер <> Неопределено Тогда		
		ДанныеДляЗаполнения.Вставить("РегистрационныйНомер", РеквизитыКонтрагента.РегистрационныйНомер);
	КонецЕсли;
	
	Если РеквизитыКонтрагента.Свойство("РегистрацияВНалоговомОргане") И РеквизитыКонтрагента.РегистрацияВНалоговомОргане <> Неопределено Тогда		
		ДанныеДляЗаполнения.Вставить("РегистрацияВНалоговомОргане", РеквизитыКонтрагента.РегистрацияВНалоговомОргане);
	КонецЕсли;
	
	Если РеквизитыКонтрагента.Свойство("РегистрацияВПенсионномФонде") И РеквизитыКонтрагента.РегистрацияВПенсионномФонде <> Неопределено Тогда		
		ДанныеДляЗаполнения.Вставить("РегистрацияВПенсионномФонде", РеквизитыКонтрагента.РегистрацияВПенсионномФонде);
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 17.03.2020

//++ смарт:ММ #036 176 17.03.2020 - создание партнеров от дилеров
&НаСервере
Функция ВыполнитьПоискПоПервичнойИнформацииСервер(ДанныеДляЗаполнения, ЕстьСовпадения)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("АдресТаблицаНайдено", "");
	СтруктураВозврата.Вставить("АдресДеревоДанных", "");

	ЕстьСовпадения = Ложь;
	
	ТаблицаНайдено = Новый ТаблицаЗначений;
	ТаблицаНайдено.Колонки.Добавить("Партнер", Новый ОписаниеТипов("СправочникСсылка.Партнеры"));
	ТаблицаНайдено.Колонки.Добавить("КоличествоНайденныхАналогов", Новый ОписаниеТипов("Число"));
	ТаблицаНайдено.Колонки.Добавить("ПредставлениеПартнер", Новый ОписаниеТипов("Строка"));
	ТаблицаНайдено.Колонки.Добавить("ОсновнойМенеджер", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	ТаблицаНайдено.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	ТаблицаНайдено.Колонки.Добавить("ИдентификаторДереваДанных", Новый ОписаниеТипов("Число"));
	ТаблицаНайдено.Колонки.Добавить("ДубльИННКПП", Новый ОписаниеТипов("Булево"));
	ТаблицаНайдено.Колонки.Добавить("Различие", Новый ОписаниеТипов("Булево"));

	ДеревоЗначений = смартПроверкаПартнеров.ВыполнитьПоискПоПервичнойИнформации(ДанныеДляЗаполнения,,, ТаблицаНайдено);
	
	Если ТаблицаНайдено.Количество() > 0 Тогда	
		АдресТаблицаНайдено = ПоместитьВоВременноеХранилище(ТаблицаНайдено);
		АдресДеревоДанных = ПоместитьВоВременноеХранилище(ДеревоЗначений);
		
		СтруктураВозврата.Вставить("АдресТаблицаНайдено", АдресТаблицаНайдено);
		СтруктураВозврата.Вставить("АдресДеревоДанных", АдресДеревоДанных);

		ЕстьСовпадения = Истина;
	КонецЕсли;	
		
	Возврат СтруктураВозврата;
	
КонецФункции //-- смарт:ММ 17.03.2020
			
//++ смарт:ММ #036 176 15.03.2020 - создание партнеров от дилеров
Процедура ЗаписатьПартнераИСвязанныеДанные(ДанныеДляЗаполнения, СозданныйПартнер, СозданныйКонтрагент, РезультатФормирования)
	
	НачатьТранзакцию();
	
	Название 						= ДанныеДляЗаполнения.Название;
	Клиент 							= ДанныеДляЗаполнения.Клиент;
	ФактическийАдрес 				= ДанныеДляЗаполнения.ФактическийАдрес;
	ФактическийАдресЗначенияПолей 	= ДанныеДляЗаполнения.ФактическийАдресЗначенияПолей;
	ЮридическийАдрес 				= ДанныеДляЗаполнения.ЮридическийАдрес;
	ЮридическийАдресЗначенияПолей 	= ДанныеДляЗаполнения.ЮридическийАдресЗначенияПолей;

	ЭтоКомпания 					= ДанныеДляЗаполнения.ЭтоКомпания;
	ВидКомпании                    	= ДанныеДляЗаполнения.ВидКомпании;
	ФамилияКЛ 						= ДанныеДляЗаполнения.ФамилияКЛ;
	ИмяКЛ 							= ДанныеДляЗаполнения.ИмяКЛ;
	ОтчествоКЛ 						= ДанныеДляЗаполнения.ОтчествоКЛ;
	АдресЭПКЛ 						= ДанныеДляЗаполнения.АдресЭПКЛ;
	ТелефонКЛЗначенияПолей 			= ДанныеДляЗаполнения.ТелефонКЛЗначенияПолей;
	ТелефонКЛ 						= ДанныеДляЗаполнения.ТелефонКЛ;
	МобильныйТелефонКЛЗначенияПолей = ДанныеДляЗаполнения.МобильныйТелефонКЛЗначенияПолей;
	МобильныйТелефонКЛ 				= ДанныеДляЗаполнения.МобильныйТелефонКЛ;
	ИспользуютсяТолькоПартнеры 		= ДанныеДляЗаполнения.ИспользуютсяТолькоПартнеры;
	ИННПартнерФизЛицо 				= ДанныеДляЗаполнения.ИННПартнерФизЛицо;
	ИНН 							= ДанныеДляЗаполнения.ИНН;
	КПП 							= ДанныеДляЗаполнения.КПП;
	КодПоОКПО 						= ДанныеДляЗаполнения.КодПоОКПО;
	СтранаРегистрации 				= ДанныеДляЗаполнения.СтранаРегистрации;
	РегистрационныйНомер			= ДанныеДляЗаполнения.РегистрационныйНомер;
	НалоговыйНомер 					= ДанныеДляЗаполнения.НалоговыйНомер;
	ТелефонКонтрагентаЗначенияПолей = ДанныеДляЗаполнения.ТелефонКонтрагентаЗначенияПолей;
	ТелефонКонтрагента 				= ДанныеДляЗаполнения.ТелефонКонтрагента;
	ТелефонПартнераФизЛицоЗначенияПолей = ДанныеДляЗаполнения.ТелефонПартнераФизЛицоЗначенияПолей;
	ТелефонПартнераФизЛицо 			= ДанныеДляЗаполнения.ТелефонПартнераФизЛицо;
	УказатьДанныеКонтактногоЛица 	= ДанныеДляЗаполнения.УказатьДанныеКонтактногоЛица;
	УказыватьЮридическиеРеквизиты 	= ДанныеДляЗаполнения.УказыватьЮридическиеРеквизиты;
	ТелефонПартнера 				= ДанныеДляЗаполнения.ТелефонПартнера;
	ПолноеЮридическоеНаименование 	= ДанныеДляЗаполнения.ПолноеЮридическоеНаименование;
	ФамилияПартнера 				= ДанныеДляЗаполнения.ФамилияПартнера;
	ИмяПартнера 					= ДанныеДляЗаполнения.ИмяПартнера;
	ОтчествоПартнера 				= ДанныеДляЗаполнения.ОтчествоПартнера;
	ИННИсточникДанныхЗаполнения 	= ДанныеДляЗаполнения.ИННИсточникДанныхЗаполнения;
	БизнесРегион 					= ДанныеДляЗаполнения.БизнесРегион;
	//Если ДействиеПоРезультатамНайдено <> 0 Тогда
	//	
		//Партнер
		ОбъектПартнер = Справочники.Партнеры.СоздатьЭлемент();
		ОбъектПартнер.Наименование                          = Название;
	//	ОбъектПартнер.Родитель                              = Родитель;
		ОбъектПартнер.БизнесРегион                          = БизнесРегион;
	//	ОбъектПартнер.ГруппаДоступа                         = ГруппаДоступа;
		ОбъектПартнер.ДатаРегистрации                       = ТекущаяДатаСеанса();
		ОбъектПартнер.Клиент                                = Клиент;
	//	ОбъектПартнер.Конкурент                             = Конкурент;
	//	ОбъектПартнер.Поставщик                             = Поставщик;
	//	ОбъектПартнер.ОбслуживаетсяТорговымиПредставителями = ОбслуживаетсяТорговымиПредставителями;
	//	ОбъектПартнер.ПрочиеОтношения                       = ПрочиеОтношения;
		ОбъектПартнер.ОсновнойМенеджер                      = ПараметрыСеанса.ТекущийПользователь;
		ОбъектПартнер.НаименованиеПолное                    = смартПроверкаПартнеров.НаименованиеПартнера(ДанныеДляЗаполнения);
		ОбъектПартнер.ЮрФизЛицо                             = смартПроверкаПартнеров.ТипЮрФизЛицаПартнера(ДанныеДляЗаполнения.ЭтоКомпания);
	//	ОбъектПартнер.Пол                                   = Пол;
	//	ОбъектПартнер.ДатаРождения                          = ДатаРождения;
	//	ОбъектПартнер.Перевозчик                            = Перевозчик;
	//	ОбъектПартнер.ВариантОтправкиЭлектронногоЧека       = ВариантОтправкиЭлектронногоЧека;
	//	
		// контактная информация партнера
		Если НЕ ПустаяСтрока(ФактическийАдрес) Тогда
			НоваяСтрокаКИ = ОбъектПартнер.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Тип               = Перечисления.ТипыКонтактнойИнформации.Адрес;
			НоваяСтрокаКИ.Вид               = Справочники.ВидыКонтактнойИнформации.АдресПартнера;
			НоваяСтрокаКИ.Представление     = ФактическийАдрес;
			НоваяСтрокаКИ.ЗначенияПолей     = ФактическийАдресЗначенияПолей;
			НоваяСтрокаКИ.Значение     		= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(ФактическийАдресЗначенияПолей);
		КонецЕсли;
		
		Если ЭтоКомпания = 0 Тогда
			ИмяРеквизитаТелефон = "ТелефонПартнера";
			ИмяРеквизитаТелефонЗначенияПолей = "ТелефонПартнераЗначенияПолей";
			ИмяРеквизитаАдресЭП = "АдресЭППартнера";
		Иначе
			ИмяРеквизитаТелефон = "ТелефонПартнераФизЛицо";
			ИмяРеквизитаТелефонЗначенияПолей = "ТелефонПартнераФизЛицоЗначенияПолей";
			ИмяРеквизитаАдресЭП = "АдресЭППартнераФизЛицо";
		КонецЕсли;
		
		Если смартПроверкаПартнеров.ЗначенияПолейВСписокЗначений(ДанныеДляЗаполнения[ИмяРеквизитаТелефонЗначенияПолей]).Количество()> 0 Тогда
			НоваяСтрокаКИ = ОбъектПартнер.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Тип               = Перечисления.ТипыКонтактнойИнформации.Телефон;
			НоваяСтрокаКИ.Вид               = Справочники.ВидыКонтактнойИнформации.ТелефонПартнера;
			НоваяСтрокаКИ.Представление     = ДанныеДляЗаполнения[ИмяРеквизитаТелефон];
			НоваяСтрокаКИ.ЗначенияПолей     = ДанныеДляЗаполнения[ИмяРеквизитаТелефонЗначенияПолей];
			НоваяСтрокаКИ.Значение     		= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(ДанныеДляЗаполнения[ИмяРеквизитаТелефонЗначенияПолей]);
		КонецЕсли;
		
		Если Не ПустаяСтрока(ДанныеДляЗаполнения[ИмяРеквизитаАдресЭП]) Тогда
			НоваяСтрокаКИ = ОбъектПартнер.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Тип               = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
			НоваяСтрокаКИ.Вид               = Справочники.ВидыКонтактнойИнформации.EmailПартнера;
			НоваяСтрокаКИ.Представление     = ДанныеДляЗаполнения[ИмяРеквизитаАдресЭП];
			НоваяСтрокаКИ.Значение     		= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(НоваяСтрокаКИ.Представление, НоваяСтрокаКИ.Вид);
			НоваяСтрокаКИ.ЗначенияПолей     = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(НоваяСтрокаКИ.Значение, НоваяСтрокаКИ.Представление, НоваяСтрокаКИ.Вид);
			НоваяСтрокаКИ.АдресЭП           = ДанныеДляЗаполнения[ИмяРеквизитаАдресЭП];
			Поз = СтрНайти(ДанныеДляЗаполнения[ИмяРеквизитаАдресЭП], "@");
			Если Поз <> 0 Тогда
				НоваяСтрокаКИ.ДоменноеИмяСервера = Сред(ДанныеДляЗаполнения[ИмяРеквизитаАдресЭП], Поз+1);
			КонецЕсли;
		КонецЕсли;
		
		//// СтандартныеПодсистемы.Свойства
		//УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ПартнерОбъектДопРеквизиты);
		//ОбъектПартнер.ДополнительныеРеквизиты.Загрузить(ПартнерОбъектДопРеквизиты.ДополнительныеРеквизиты.Выгрузить());
		//// Конец СтандартныеПодсистемы.Свойства
		
		ОбъектПартнер.Записать();
		ПартнерВыбор = ОбъектПартнер.Ссылка;
		
		СозданныйПартнер = ОбъектПартнер.Ссылка;
		
		//СписокСозданных.Добавить(ПолучитьНавигационнуюСсылку(ПартнерВыбор), ОбъектПартнер.Наименование);
		
	//	// зафиксировать первичный интерес
	//	Если ПолучитьФункциональнуюОпцию("ФиксироватьПервичныйИнтерес") И ЗначениеЗаполнено(КаналПервичногоИнтереса) Тогда
	//	
	//		УстановитьПривилегированныйРежим(Истина);
	//		Запись = РегистрыСведений.ИсточникиПервичногоИнтереса.СоздатьМенеджерЗаписи();
	//		Запись.Партнер                    = ПартнерВыбор;
	//		Запись.КаналПервичногоИнтереса    = КаналПервичногоИнтереса;
	//		Запись.ИсточникПервичногоИнтереса = ИсточникПервичногоИнтереса;
	//		Запись.Записать();
	//		УстановитьПривилегированныйРежим(Ложь);
	//	
	//	КонецЕсли;
	//	
	//	//сегмент
	//	Если ЗначениеЗаполнено(Сегмент)
	//		И ЕстьПравоВключенияВСегмент
	//		И Сегмент.СпособФормирования = Перечисления.СпособыФормированияСегментов.ФормироватьВручную Тогда
	//		СегментыСервер.ДобавитьПартнераВСегмент(Сегмент, ПартнерВыбор);
	//	КонецЕсли;
	//	
		// Контактное лицо
		Если ЭтоКомпания = 0 И УказатьДанныеКонтактногоЛица И НЕ ПустаяСтрока(ИмяКЛ) Тогда
		
			ОбъектКонтактноеЛицо = Справочники.КонтактныеЛицаПартнеров.СоздатьЭлемент();
			ОбъектКонтактноеЛицо.Владелец               = ПартнерВыбор;
			ОбъектКонтактноеЛицо.ДатаРегистрацииСвязи   = ТекущаяДатаСеанса();
			ОбъектКонтактноеЛицо.Наименование           = смартПроверкаПартнеров.ФИО_ОднойСтрокой(ФамилияКЛ, ИмяКЛ, ОтчествоКЛ);
			ОбъектКонтактноеЛицо.Автор 					= ПараметрыСеанса.ТекущийПользователь;
			
			Если Не ПустаяСтрока(АдресЭПКЛ) Тогда
				НоваяСтрокаКИ = ОбъектКонтактноеЛицо.КонтактнаяИнформация.Добавить();
				НоваяСтрокаКИ.Тип               = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
				НоваяСтрокаКИ.Вид               = Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;
				НоваяСтрокаКИ.Представление     = АдресЭПКЛ;
				НоваяСтрокаКИ.Значение		    = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(НоваяСтрокаКИ.Представление, НоваяСтрокаКИ.Вид);
				НоваяСтрокаКИ.ЗначенияПолей     = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(НоваяСтрокаКИ.Значение, НоваяСтрокаКИ.Представление, НоваяСтрокаКИ.Вид);
				НоваяСтрокаКИ.АдресЭП           = АдресЭПКЛ;
				Поз = СтрНайти(АдресЭПКЛ, "@");
				Если Поз <> 0 Тогда
					НоваяСтрокаКИ.ДоменноеИмяСервера = Сред(АдресЭПКЛ, Поз+1);
				КонецЕсли;
			КонецЕсли;
			
			Если смартПроверкаПартнеров.ЗначенияПолейВСписокЗначений(ТелефонКЛЗначенияПолей).Количество()> 0 Тогда
				НоваяСтрокаКИ = ОбъектКонтактноеЛицо.КонтактнаяИнформация.Добавить();
				НоваяСтрокаКИ.Тип               = Перечисления.ТипыКонтактнойИнформации.Телефон;
				НоваяСтрокаКИ.Вид               = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица;
				НоваяСтрокаКИ.Представление     = ТелефонКЛ;
				НоваяСтрокаКИ.ЗначенияПолей     = ТелефонКЛЗначенияПолей;
				НоваяСтрокаКИ.Значение     		= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(ТелефонКЛЗначенияПолей);
			КонецЕсли;
			
			Если смартПроверкаПартнеров.ЗначенияПолейВСписокЗначений(МобильныйТелефонКЛЗначенияПолей).Количество()> 0 Тогда
				НоваяСтрокаКИ = ОбъектКонтактноеЛицо.КонтактнаяИнформация.Добавить();
				НоваяСтрокаКИ.Тип               = Перечисления.ТипыКонтактнойИнформации.Телефон;
				НоваяСтрокаКИ.Вид               = Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица;
				НоваяСтрокаКИ.Представление     = МобильныйТелефонКЛ;
				НоваяСтрокаКИ.ЗначенияПолей     = МобильныйТелефонКЛЗначенияПолей;
				НоваяСтрокаКИ.Значение     		= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(МобильныйТелефонКЛЗначенияПолей);
			КонецЕсли;
			
			ОбъектКонтактноеЛицо.Записать();
			//СписокСозданных.Добавить(ПолучитьНавигационнуюСсылку(ОбъектКонтактноеЛицо.Ссылка), ОбъектКонтактноеЛицо.Наименование);
			
		КонецЕсли;
		
	//КонецЕсли;
	
	//Контрагент
	//Если ИспользуютсяТолькоПартнеры Или (ДействиеСКонтрагентом = 1 И НЕ НаОснованииКонтрагента И УказыватьЮридическиеРеквизиты) Тогда
	Если УказыватьЮридическиеРеквизиты Тогда
		
		ОбъектКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
		ОбъектКонтрагент.Наименование          = ?(ИспользуютсяТолькоПартнеры, Название, смартПроверкаПартнеров.НаименованиеКонтрагента(ДанныеДляЗаполнения));
		ОбъектКонтрагент.ЮрФизЛицо             = смартПроверкаПартнеров.ТипЮрФизЛицаКонтрагента(ЭтоКомпания, ВидКомпании);
		//ОбъектКонтрагент.НДСПоСтавкам4и2       = ?(Поставщик И ЭтоКомпания = 0 И ВидКомпании <> 1, НДСПоСтавкам4и2, Ложь);
		ОбъектКонтрагент.ИНН                   = ?(ЭтоКомпания = 0,?(ВидКомпании <> 1,ИНН,""),ИННПартнерФизЛицо);
		ОбъектКонтрагент.КПП                   = ?(ЭтоКомпания = 0 И (ВидКомпании = 0 Или ВидКомпании = 3),КПП,"");
		ОбъектКонтрагент.КодПоОКПО             = ?(ЭтоКомпания = 0 И ВидКомпании <> 1,КодПоОКПО,"");
		ОбъектКонтрагент.Партнер               = ПартнерВыбор;
		ОбъектКонтрагент.НаименованиеПолное    = ?(ЭтоКомпания = 0,ПолноеЮридическоеНаименование,смартПроверкаПартнеров.ФИО_ОднойСтрокой(ФамилияПартнера, ИмяПартнера, ОтчествоПартнера));
		ОбъектКонтрагент.СтранаРегистрации     = ?(ОбъектКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент, СтранаРегистрации, Справочники.СтраныМира.Россия);
		ОбъектКонтрагент.РегистрационныйНомер  = ?(ОбъектКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент, РегистрационныйНомер, "");
		ОбъектКонтрагент.НалоговыйНомер        = ?(ОбъектКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент, НалоговыйНомер, "");
		
				
		Если РезультатФормирования.Свойство("ИсторияРеквизитов")
			И ТипЗнч(РезультатФормирования.ИсторияРеквизитов) = Тип("ФиксированнаяСтруктура") Тогда
			
			Если РезультатФормирования.ИсторияРеквизитов.Свойство("КПП") Тогда
				ИсторияКПП = Новый ТаблицаЗначений;
				ИсторияКПП.Колонки.Добавить("Период");
				ИсторияКПП.Колонки.Добавить("КПП");
				
				ИсторияКППМассивСтруктур = РезультатФормирования.ИсторияРеквизитов.КПП;
				Для Каждого мСтруктура Из ИсторияКППМассивСтруктур Цикл
					НоваяСтрока = ИсторияКПП.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, мСтруктура);
				КонецЦикла;
				
				ОбъектКонтрагент.ИсторияКПП.Загрузить(ИсторияКПП);
			КонецЕсли;
			
			Если РезультатФормирования.ИсторияРеквизитов.Свойство("Наименование") Тогда
				ИсторияНаименований = Новый ТаблицаЗначений;
				ИсторияНаименований.Колонки.Добавить("Период");
				ИсторияНаименований.Колонки.Добавить("НаименованиеПолное");
				
				ИсторияНаименованийМассивСтруктур = РезультатФормирования.ИсторияРеквизитов.Наименование;
				Для Каждого мСтруктура Из ИсторияНаименованийМассивСтруктур Цикл
					НоваяСтрока = ИсторияНаименований.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, мСтруктура);
				КонецЦикла;
				
				ОбъектКонтрагент.ИсторияНаименований.Загрузить(ИсторияНаименований);
			КонецЕсли;
		КонецЕсли;
	
		// контактная информация контрагента
		Если НЕ ПустаяСтрока(ФактическийАдрес) Тогда
			НоваяСтрокаКИ = ОбъектКонтрагент.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Тип           = Перечисления.ТипыКонтактнойИнформации.Адрес;
			НоваяСтрокаКИ.Вид           = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
			НоваяСтрокаКИ.Представление = ФактическийАдрес;
			НоваяСтрокаКИ.ЗначенияПолей = ФактическийАдресЗначенияПолей;
			НоваяСтрокаКИ.Значение     	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(ФактическийАдресЗначенияПолей);
		КонецЕсли;
		
		//Если ИсторияКонтактнойИнформации.Количество() > 0 Тогда
		//	ПартнерыИКонтрагенты.ВключитьХранениеИсторииИзменений("ЮрАдресКонтрагента");
		//	ИсторияКонтактнойИнформации[0].Дата = Неопределено;
		//	УправлениеКонтактнойИнформацией.УстановитьКонтактнуюИнформациюОбъекта(ОбъектКонтрагент, ИсторияКонтактнойИнформации);
	//	Иначе
		Если НЕ ПустаяСтрока(ЮридическийАдрес) Тогда
			НоваяСтрокаКИ = ОбъектКонтрагент.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Тип           = Перечисления.ТипыКонтактнойИнформации.Адрес;
			НоваяСтрокаКИ.Вид           = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
			НоваяСтрокаКИ.Представление = ЮридическийАдрес;
			НоваяСтрокаКИ.ЗначенияПолей = ЮридическийАдресЗначенияПолей;
			НоваяСтрокаКИ.Значение     	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(ЮридическийАдресЗначенияПолей);
			
			Если ПустаяСтрока(ФактическийАдрес) Тогда
				// Заполнить фактический адрес по юридическому
				НоваяСтрокаКИ = ОбъектКонтрагент.КонтактнаяИнформация.Добавить();
				НоваяСтрокаКИ.Тип           = Перечисления.ТипыКонтактнойИнформации.Адрес;
				НоваяСтрокаКИ.Вид           = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
				НоваяСтрокаКИ.Представление = ЮридическийАдрес;
				НоваяСтрокаКИ.ЗначенияПолей = ЮридическийАдресЗначенияПолей;
				НоваяСтрокаКИ.Значение     	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(ЮридическийАдресЗначенияПолей);
			КонецЕсли;
			
		КонецЕсли;
	//	
		Если ЭтоКомпания = 0 И НЕ ПустаяСтрока(ТелефонПартнера) Тогда
	//		
	//		Если ИспользуютсяТолькоПартнеры Тогда
	//		
	//			НоваяСтрокаКИ = ОбъектКонтрагент.КонтактнаяИнформация.Добавить();
	//			НоваяСтрокаКИ.Тип           = Перечисления.ТипыКонтактнойИнформации.Телефон;
	//			НоваяСтрокаКИ.Вид           = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
	//			НоваяСтрокаКИ.Представление = ТелефонПартнера;
	//			НоваяСтрокаКИ.ЗначенияПолей = ТелефонПартнераЗначенияПолей;
	//			НоваяСтрокаКИ.Значение     	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(ТелефонПартнераЗначенияПолей);
	//			
	//		Иначе
	//			
				Если ИНН = ИННИсточникДанныхЗаполнения Тогда
					
					НоваяСтрокаКИ = ОбъектКонтрагент.КонтактнаяИнформация.Добавить();
					НоваяСтрокаКИ.Тип           = Перечисления.ТипыКонтактнойИнформации.Телефон;
					НоваяСтрокаКИ.Вид           = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
					НоваяСтрокаКИ.Представление = ТелефонКонтрагента;
					НоваяСтрокаКИ.ЗначенияПолей = ТелефонКонтрагентаЗначенияПолей;
					НоваяСтрокаКИ.Значение     	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(ТелефонКонтрагентаЗначенияПолей);
					
				КонецЕсли;
	//		
	//		КонецЕсли;
	//		
		КонецЕсли;
		
		
		Если ЭтоКомпания = 1 И НЕ ПустаяСтрока(ТелефонПартнераФизЛицо) Тогда
			НоваяСтрокаКИ = ОбъектКонтрагент.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Тип           = Перечисления.ТипыКонтактнойИнформации.Телефон;
			НоваяСтрокаКИ.Вид           = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
			НоваяСтрокаКИ.Представление = ТелефонПартнераФизЛицо;
			НоваяСтрокаКИ.ЗначенияПолей = ТелефонПартнераФизЛицоЗначенияПолей;
			НоваяСтрокаКИ.Значение     	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(ТелефонПартнераФизЛицоЗначенияПолей);
		КонецЕсли;
	//	
	//	// головной контрагент
	//	Если ЭтоКомпания = 0 И ВидКомпании = 3 Тогда
	//		
	//		ОбъектКонтрагент.ОбособленноеПодразделение = Истина;
	//		
	//		Если ИспользуютсяТолькоПартнеры Или ВыбратьГоловногоКонтрагента = 0 Тогда
	//			ОбъектКонтрагент.ГоловнойКонтрагент = ГоловнойКонтрагент;
	//		ИначеЕсли ВыбратьГоловногоКонтрагента = 1 Тогда
	//			
	//			ОбъектГоловнойКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
	//			
	//			ОбъектГоловнойКонтрагент.Наименование       = НаименованиеГоловногоКонтрагента;
	//			ОбъектГоловнойКонтрагент.НаименованиеПолное = ПолноеНаименованиеГоловногоКонтрагента;
	//			ОбъектГоловнойКонтрагент.ЮрФизЛицо          = Перечисления.ЮрФизЛицо.ЮрЛицо;
	//			ОбъектГоловнойКонтрагент.ИНН                = ИНН;
	//			ОбъектГоловнойКонтрагент.КПП                = КППГоловногоКонтрагента;
	//			ОбъектГоловнойКонтрагент.КодПоОКПО          = КодПоОКПОГоловногоКонтрагента;
	//			
	//			ОбъектГоловнойКонтрагент.Партнер = ?(ЗначениеЗаполнено(ПартнерГоловногоКонтрагента),
	//				ПартнерГоловногоКонтрагента, ПартнерВыбор);
	//			
	//			// контактная информация головного контрагента
	//			Если НЕ ПустаяСтрока(ФактическийАдресГоловногоКонтрагента) Тогда
	//				НоваяСтрокаКИ = ОбъектГоловнойКонтрагент.КонтактнаяИнформация.Добавить();
	//				НоваяСтрокаКИ.Тип           = Перечисления.ТипыКонтактнойИнформации.Адрес;
	//				НоваяСтрокаКИ.Вид           = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
	//				НоваяСтрокаКИ.Представление = ФактическийАдресГоловногоКонтрагента;
	//				НоваяСтрокаКИ.ЗначенияПолей = ФактическийАдресГоловногоКонтрагентаЗначенияПолей;
	//				НоваяСтрокаКИ.Значение     	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(ФактическийАдресГоловногоКонтрагентаЗначенияПолей);
	//			КонецЕсли;
	//			
	//			Если НЕ ПустаяСтрока(ЮридическийАдресГоловногоКонтрагента) Тогда
	//				НоваяСтрокаКИ = ОбъектГоловнойКонтрагент.КонтактнаяИнформация.Добавить();
	//				НоваяСтрокаКИ.Тип           = Перечисления.ТипыКонтактнойИнформации.Адрес;
	//				НоваяСтрокаКИ.Вид           = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
	//				НоваяСтрокаКИ.Представление = ЮридическийАдресГоловногоКонтрагента;
	//				НоваяСтрокаКИ.ЗначенияПолей = ЮридическийАдресГоловногоКонтрагентаЗначенияПолей;
	//				НоваяСтрокаКИ.Значение     	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(ЮридическийАдресГоловногоКонтрагентаЗначенияПолей);
	//			КонецЕсли;
	//			
	//			ОбъектГоловнойКонтрагент.Записать();
	//			СписокСозданных.Добавить(ПолучитьНавигационнуюСсылку(ОбъектГоловнойКонтрагент.Ссылка), ОбъектГоловнойКонтрагент.Наименование);
	//			ОбъектКонтрагент.ГоловнойКонтрагент = ОбъектГоловнойКонтрагент.Ссылка;
	//			
	//			// банковский счет головного контрагента
	//			Если УказатьБанковскийСчетГоловногоКонтрагента Тогда
	//				
	//				Валютный = (ВалютаДенежныхСредствГоловнойКонтрагент <> ВалютаРеглУчета);
	//				
	//				БанковскийСчет = Справочники.БанковскиеСчетаКонтрагентов.СоздатьЭлемент();
	//				БанковскийСчет.Владелец = ОбъектГоловнойКонтрагент.Ссылка;
	//				БанковскийСчет.Наименование = АвтоНаименованиеБанковскогоСчета(
	//					НомерСчетаГоловногоКонтрагента, БанкГоловнойКонтрагент, ВалютаДенежныхСредствГоловнойКонтрагент);
	//				БанковскийСчет.ВалютаДенежныхСредств = ВалютаДенежныхСредствГоловнойКонтрагент;
	//				БанковскийСчет.НомерСчета = НомерСчетаГоловногоКонтрагента;
	//				БанковскийСчет.Банк = БанкГоловнойКонтрагент;
	//				БанковскийСчет.БанкДляРасчетов = БанкДляРасчетовГоловнойКонтрагент;
	//				БанковскийСчет.СчетВБанкеДляРасчетов = СчетВБанкеДляРасчетовГоловнойКонтрагент;
	//				
	//				Если ИностранныйБанкГоловнойКонтрагент = 1 Тогда
	//					БанковскийСчет.ИностранныйБанк = Истина;
	//					БанковскийСчет.РучноеИзменениеРеквизитовБанка = Истина;
	//					БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов = Истина;
	//					БанковскийСчет.БИКБанка = БИКБанкаГоловнойКонтрагент;
	//				Иначе
	//					БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов = Валютный;
	//				КонецЕсли;
	//				
	//				БанковскийСчет.БИКБанкаДляРасчетов = БИКБанкаДляРасчетовГоловнойКонтрагент;
	//				БанковскийСчет.НаименованиеБанка = НаименованиеБанкаГоловнойКонтрагент;
	//				БанковскийСчет.НаименованиеБанкаДляРасчетов = НаименованиеБанкаДляРасчетовГоловнойКонтрагент;
	//				БанковскийСчет.АдресБанка = АдресБанкаГоловнойКонтрагент;
	//				БанковскийСчет.АдресБанкаДляРасчетов = АдресБанкаДляРасчетовГоловнойКонтрагент;
	//				БанковскийСчет.СВИФТБанка = СВИФТБанкаГоловнойКонтрагент;
	//				БанковскийСчет.СВИФТБанкаДляРасчетов = СВИФТБанкаДляРасчетовГоловнойКонтрагент;
	//				БанковскийСчет.КоррСчетБанкаДляРасчетов = КоррСчетБанкаДляРасчетовГоловнойКонтрагент;
	//				
	//				БанковскийСчет.Записать();
	//				СписокСозданных.Добавить(ПолучитьНавигационнуюСсылку(БанковскийСчет.Ссылка), БанковскийСчет.Наименование);
	//				
	//			КонецЕсли;
	//			
	//		КонецЕсли;
	//	КонецЕсли;
	//	
		ОбъектКонтрагент.смартЗаполнитьЕmailТелефонИзПартнера(Истина, Ложь);
		//ОбъектКонтрагент.смартЗаполнитьФактическийАдресПоЮридическому();
		ОбъектКонтрагент.Записать();
		//КонтрагентВыбор = ОбъектКонтрагент.Ссылка;
		СозданныйКонтрагент = ОбъектКонтрагент.Ссылка;
		//СписокСозданных.Добавить(ПолучитьНавигационнуюСсылку(КонтрагентВыбор), ОбъектКонтрагент.Наименование);
	//	
	//	// банковский счет
	//	Если УказатьБанковскийСчетКонтрагента Тогда
	//		
	//		Валютный = (ВалютаДенежныхСредств <> ВалютаРеглУчета);
	//		
	//		БанковскийСчет = Справочники.БанковскиеСчетаКонтрагентов.СоздатьЭлемент();
	//		БанковскийСчет.Владелец = КонтрагентВыбор;
	//		БанковскийСчет.Наименование = АвтоНаименованиеБанковскогоСчета(НомерСчета, Банк, ВалютаДенежныхСредств);
	//		БанковскийСчет.ВалютаДенежныхСредств = ВалютаДенежныхСредств;
	//		БанковскийСчет.НомерСчета = НомерСчета;
	//		БанковскийСчет.Банк = Банк;
	//		БанковскийСчет.БанкДляРасчетов = БанкДляРасчетов;
	//		БанковскийСчет.СчетВБанкеДляРасчетов = СчетВБанкеДляРасчетов;
	//		
	//		Если ИностранныйБанк = 1 Тогда
	//			БанковскийСчет.ИностранныйБанк = Истина;
	//			БанковскийСчет.РучноеИзменениеРеквизитовБанка = Истина;
	//			БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов = Истина;
	//			БанковскийСчет.БИКБанка = БИКБанка;
	//		Иначе
	//			БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов = Валютный;
	//		КонецЕсли;
	//		
	//		БанковскийСчет.БИКБанкаДляРасчетов = БИКБанкаДляРасчетов;
	//		БанковскийСчет.НаименованиеБанка = НаименованиеБанка;
	//		БанковскийСчет.НаименованиеБанкаДляРасчетов = НаименованиеБанкаДляРасчетов;
	//		БанковскийСчет.АдресБанка = АдресБанка;
	//		БанковскийСчет.АдресБанкаДляРасчетов = АдресБанкаДляРасчетов;
	//		БанковскийСчет.СВИФТБанка = СВИФТБанка;
	//		БанковскийСчет.СВИФТБанкаДляРасчетов = СВИФТБанкаДляРасчетов;
	//		БанковскийСчет.КоррСчетБанкаДляРасчетов = КоррСчетБанкаДляРасчетов;
	//		
	//		БанковскийСчет.Записать();
	//		СписокСозданных.Добавить(ПолучитьНавигационнуюСсылку(БанковскийСчет.Ссылка), БанковскийСчет.Наименование);
	//		
	//	КонецЕсли;
	//	
	//	Если ЭтоКомпания = 1 И УказыватьЮридическиеРеквизиты И УказатьДокументУдостоверяющийЛичность Тогда
	//		
	//		МенеджерЗаписи = РегистрыСведений.ДокументыФизическихЛиц.СоздатьМенеджерЗаписи();
	//		МенеджерЗаписи.Активность                               = Истина;
	//		МенеджерЗаписи.Период                                   = ТекущаяДатаСеанса();
	//		МенеджерЗаписи.Физлицо                                  = КонтрагентВыбор;
	//		МенеджерЗаписи.ВидДокумента                             = ВидДокумента;
	//		МенеджерЗаписи.Серия                                    = СерияДокумента;
	//		МенеджерЗаписи.Номер                                    = НомерДокумента;
	//		МенеджерЗаписи.ДатаВыдачи                               = ДатаВыдачи;
	//		МенеджерЗаписи.СрокДействия                             = СрокДействия;
	//		МенеджерЗаписи.КемВыдан                                 = КемВыданДокумент;
	//		МенеджерЗаписи.КодПодразделения                         = КодПодразделения;
	//		МенеджерЗаписи.ЯвляетсяДокументомУдостоверяющимЛичность = Истина;
	//		МенеджерЗаписи.Записать();
	//		
	//	КонецЕсли;
	//	
	//	// привязка обособленных подразделений
	//	Если ЭтоКомпания = 0 И ВидКомпании = 0 И ЗначениеЗаполнено(ИНН) И ПривязатьОбособленныеПодразделения = 0 Тогда
	//		
	//		Для Каждого СтрокаТаблицы Из ОбособленныеПодразделения Цикл
	//			Если СтрокаТаблицы.Выбран Тогда
	//				
	//				ОписаниеОшибки = "";
	//				ПартнерыИКонтрагентыВызовСервера.ИзменитьГоловногоКонтрагента(СтрокаТаблицы.Контрагент, КонтрагентВыбор, ОписаниеОшибки);
	//				
	//				Если НЕ ПустаяСтрока(ОписаниеОшибки) Тогда
	//					ВызватьИсключение ОписаниеОшибки;
	//				КонецЕсли;
	//				
	//			КонецЕсли;
	//		КонецЦикла;
	//		
	//	КонецЕсли;
	//	
	КонецЕсли;
	//
	//Если НаОснованииКонтрагента И ЗначениеЗаполнено(КонтрагентОснование) Тогда
	//	
	//	ВыполнитьЗаписьКонтрагентаОснование(ПартнерВыбор, КонтрагентОснование);
	//	
	//КонецЕсли;
	//
	//СозданиеВыполнено = Истина;
	//
	//СегментыСервер.ПроверитьВхождениеПартнераВСегментыПриСоздании(ПартнерВыбор);
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры //-- смарт:ММ 15.03.2020

#Область ЧтениеExcel

//++ смарт:ММ #036 176 14.03.2020 - создание партнеров от дилеров
&НаКлиенте
Функция ПрочитатьФайл(ИмяФайла)
	
	СтруктураДанныеИзФайла = Новый Структура;
	СтруктураДанныеИзФайла.Вставить("Наименование", "");
	СтруктураДанныеИзФайла.Вставить("КонтактноеЛицоФИО", "");
	СтруктураДанныеИзФайла.Вставить("КонтактноеЛицоЭлПочта", "");
	СтруктураДанныеИзФайла.Вставить("КонтактноеЛицоТелефон", "");
	СтруктураДанныеИзФайла.Вставить("ИНН", "");
	СтруктураДанныеИзФайла.Вставить("КПП", "");
	СтруктураДанныеИзФайла.Вставить("ПартнерЭлПочта", "");
	СтруктураДанныеИзФайла.Вставить("БизнесРегион", "");
	
	Отказ = Ложь;
	АдресФайла = ПереместитьФайлНаСервер(ИмяФайла, Отказ);
	Если Отказ Тогда
		Возврат СтруктураДанныеИзФайла;
	КонецЕсли;
	
	ПрочитатьФайлНаСервере(АдресФайла, СтруктураДанныеИзФайла);
		
	Возврат СтруктураДанныеИзФайла;
		
КонецФункции //-- смарт:ММ 14.03.2020

//++ смарт:ММ #036 176 16.03.2020 - создание партнеров от дилеров
&НаСервере
Процедура ПрочитатьФайлНаСервере(АдресФайла, СтруктураДанныеИзФайла)
	
	ТЗ = ЗагрузитьМетодом_1C836(АдресФайла);              // Считать весь файл.	
	Попытка
		
		Если ТЗ.Количество() >= 10 Тогда
			СтруктураДанныеИзФайла.Наименование = СокрЛП(ТЗ[2].Н2);
			СтруктураДанныеИзФайла.КонтактноеЛицоФИО = СокрЛП(ТЗ[3].Н2);
			СтруктураДанныеИзФайла.КонтактноеЛицоЭлПочта = СокрЛП(ТЗ[4].Н2);
			СтруктураДанныеИзФайла.КонтактноеЛицоТелефон = Формат(ТЗ[5].Н2, "ЧГ=");
			СтруктураДанныеИзФайла.ИНН = Формат(ТЗ[6].Н2, "ЧГ=");
			СтруктураДанныеИзФайла.КПП = Формат(ТЗ[7].Н2, "ЧГ=");
			СтруктураДанныеИзФайла.ПартнерЭлПочта = СокрЛП(ТЗ[8].Н2);
			СтруктураДанныеИзФайла.БизнесРегион = СокрЛП(ТЗ[9].Н2);
		КонецЕсли;
		
	Исключение

	КонецПопытки;
	
КонецПроцедуры //-- смарт:ММ 16.03.2020

//++ смарт:ММ #036 176 16.03.2020 - создание партнеров от дилеров
&НаКлиенте
Функция ПереместитьФайлНаСервер(ИмяФайлаДанных, Отказ)

	АдресФайлаВоВременномХранилище = "";
	
	Отказ = Ложь;
	Попытка
		Уникальный_Идентификатор = Новый УникальныйИдентификатор;
		ДвоичДанные = Новый ДвоичныеДанные(ИмяФайлаДанных);
		АдресФайлаВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичДанные, Уникальный_Идентификатор); 
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось открыть файл. Проверьте, что он не занят в приложении Excel.'"),,,,Отказ);
		Отказ = Истина;
	КонецПопытки;
	
	Возврат АдресФайлаВоВременномХранилище;
	
КонецФункции //-- смарт:ММ 16.03.2020

//++ смарт:ММ #036 176 16.03.2020 - создание партнеров от дилеров
Функция ЗагрузитьМетодом_1C836(АдресФайла,Знач СтрокаЗаголовка = 1, НачСтрока = 0, КонСтрока = 0, КолвоСтрокФайла = 0)
	Перем ТабличныйДокумент, КонечнаяКолонка, ИмяКолонки, Область, ТекущаяОбласть, нСтрока, нКолонка, НоваяСтрокаТФ, ЗначениеЯчейки;
	Перем ТаблицаРезультат;
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
	ИмяВременногоФайлаXLSX = ПолучитьИмяВременногоФайла("xlsx"); 
	ДвоичныеДанные.Записать(ИмяВременногоФайлаXLSX);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Попытка
		//ТабличныйДокумент.Прочитать(ФайлEXCEL, СпособЧтенияЗначенийТабличногоДокумента.Значение);    // СпособЧтенияЗначенийТабличногоДокумента - новый параметр платформы 8.3.6. Второе значение "Текст".
		ТабличныйДокумент.Прочитать(ИмяВременногоФайлаXLSX, СпособЧтенияЗначенийТабличногоДокумента.Значение);    // СпособЧтенияЗначенийТабличногоДокумента - новый параметр платформы 8.3.6. Второе значение "Текст".
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат Новый ТаблицаЗначений;
	КонецПопытки;
	
	КолвоСтрокФайла = ТабличныйДокумент.ВысотаТаблицы;
	КонечнаяКолонка = ТабличныйДокумент.ПолучитьОбласть().ШиринаТаблицы;
	
	// Проверка заполненности листа.
	Если КолвоСтрокФайла = 0 Тогда
		// Завершение работы.
		// Закрытие Объектов.
		ТабличныйДокумент = Неопределено;
		Возврат Новый ТаблицаЗначений;    // В случае ошибки возвращаем пустую таблицу значений.
	КонецЕсли;
	
	// Создание результирующей таблицы, в которую будут записываться считанные из файла данные.
	ТаблицаРезультат = Новый ТаблицаЗначений;
	
	// Формирование колонок результирующей таблицы.
	
	//// "НомерСтроки" - для наглядности и удобства.
	//// В зависимости от разрабатываемой обработки.
	//// "Сопоставлено" - может быть другим.
	//// Здесь же могут быть добавлены другие колонки, не формируемые из содержимого файла.
	//ТаблицаРезультат.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"), "№", 4);
	//ТаблицаРезультат.Колонки.Добавить("Сопоставлено", Новый ОписаниеТипов("Булево"), "Сопоставлено", 1);
	
	Для ит = 1 ПО КонечнаяКолонка Цикл
		нКолонка = СтрЗаменить(ит, Символы.НПП, "");
		ИмяКолонки = "Н" + нКолонка;
		ТаблицаРезультат.Колонки.Добавить(ИмяКолонки);
	КонецЦикла;
	
	// 1-я строка. Заголовки.
	НоваяСтрокаТФ = ТаблицаРезультат.Добавить();
	//НоваяСтрокаТФ.НомерСтроки = 1;
	Для ит=1 ПО КонечнаяКолонка Цикл
		нКолонка = СтрЗаменить(ит, Символы.НПП, "");
		ИмяКолонки = "Н" + нКолонка;
		НоваяСтрокаТФ[ИмяКолонки] = ТабличныйДокумент.ПолучитьОбласть("R1" + "C"+нКолонка).ТекущаяОбласть.Текст;
		
		// Используется при формировании таблицы на форме обработки.
		ШиринаКолонки = ТаблицаРезультат.Колонки[ИмяКолонки].Ширина;
		ДлинаСтроки    = СтрДлина(СокрЛП(НоваяСтрокаТФ[ИмяКолонки]));
		ТаблицаРезультат.Колонки[ИмяКолонки].Ширина = ?(ШиринаКолонки < ДлинаСтроки, ДлинаСтроки, ШиринаКолонки);
	КонецЦикла;
	
	НачСтрока = ?(НачСтрока = 0, 2, НачСтрока);
	КонСтрока = ?(КонСтрока = 0, КолвоСтрокФайла, КонСтрока);
	
	Для нСтрока = НачСтрока ПО КонСтрока Цикл
		НоваяСтрокаТФ = ТаблицаРезультат.Добавить();
		НоваяСтрокаТФ[0] = нСтрока;
		Для ит=1 ПО КонечнаяКолонка Цикл
			нКолонка = СтрЗаменить(ит, Символы.НПП, "");
			ТекущаяОбласть = ТабличныйДокумент.Область("R"+СтрЗаменить(нСтрока, Символы.НПП, "") + "C"+нКолонка);
			Если ТекущаяОбласть.СодержитЗначение Тогда 
				ЗначениеЯчейки = ТекущаяОбласть.Значение;        // Число, Дата.
			Иначе
				ЗначениеЯчейки = СокрЛП(ТекущаяОбласть.Текст);    // Строка, Булево. (Булево как строка "ИСТИНА"/"ЛОЖЬ")
			КонецЕсли;
			
			ИмяКолонки = "Н" + нКолонка;
			НоваяСтрокаТФ[ИмяКолонки] = ЗначениеЯчейки;
		КонецЦикла;
	КонецЦикла;
	
	КоличествоСтрок = ТаблицаРезультат.Количество();
	ПоследняяПустаяСтрока = Истина;
	Для Каждого Колонка Из ТаблицаРезультат.Колонки Цикл
		Если ЗначениеЗаполнено(ТаблицаРезультат[КоличествоСтрок - 1][Колонка.Имя]) Тогда
			ПоследняяПустаяСтрока = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ПоследняяПустаяСтрока Тогда 
		ТаблицаРезультат.Удалить(ТаблицаРезультат[КоличествоСтрок - 1]);
	КонецЕсли;
	
	Возврат ТаблицаРезультат;
	
КонецФункции //-- смарт:ММ 16.03.2020

#КонецОбласти

#Область ОтправкаПисьмаСВложением

//++ смарт:ММ #036 176 14.03.2020 - создание партнеров от дилеров
&НаКлиенте
Процедура смартОтправитьШаблонДилеруНажатие(Команда)

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
				
		АдресХранилища = ПолучитьАдресВложенияНаСервере();
		
		Вложения = Новый Массив;
		ДанныеВложения = Новый Структура();
		ДанныеВложения.Вставить("Представление", "Формат для загрузки.xlsx");
		ДанныеВложения.Вставить("АдресВоВременномХранилище", АдресХранилища);
		Вложения.Добавить(ДанныеВложения);

		Текст = "Уважаемый дилер! 
		|К письму прикреплен шаблон для заполнения информации по партнеру, который передается в СМАРТ-Т.
		|Просьба заполнить шаблон и выслать ответным письмом.
		|Благодарим за сотрудничество!";

		Партнер = ТекущиеДанные.Ссылка;
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("Основание", Партнер);
		ПараметрыОткрытияФормы.Вставить("Вложения", Вложения);
		ПараметрыОткрытияФормы.Вставить("Текст", Текст);
		ПараметрыОткрытияФормы.Вставить("Тема", "Шаблон для заполнения информации по партнеру, который передается в СМАРТ-Т");
		
		ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.ФормаОбъекта", ПараметрыОткрытияФормы, ЭтаФорма);
		
	КонецЕсли;

КонецПроцедуры //-- смарт:ММ 14.03.2020

//++ смарт:ММ #036 176 14.03.2020 - создание партнеров от дилеров
&НаСервере
Функция ПолучитьАдресВложенияНаСервере()
	
	Возврат ПоместитьВоВременноеХранилище(ПолучитьОбщийМакет("смартШаблонДилеруДляПередачиПартнера"));
	
КонецФункции //-- смарт:ММ 14.03.2020

#КонецОбласти
